var poiData = [
    {
        "id": "poi_1",
        "lat": 22.648207,
        "lon": 120.350123,
        "alt": 60,
        "title": "圖科大樓",
        "class": 0,
        "area": [
            {
                "lat": 22.648207,
                "lon": 120.350123,
                "radius": 30
            },
            {
                "lat": 22.651153,
                "lon": 120.349837,
                "radius": 15
            },
            {
                "lat": 22.650312,
                "lon": 120.349577,
                "radius": 15
            }
        ]
    },
    {
        "id": "poi_2",
        "lat": 22.648583,
        "lon": 120.350790,
        "alt": 55,
        "title": "人文大樓",
        "class": 0
    },
    {
        "id": "poi_3",
        "lat": 22.650761,
        "lon": 120.349651,
        "alt": 70,
        "title": "綜合大樓",
        "class": 0,
        "keyword": [{ "ky": "行政大樓," }]
    },
    {
        "id": "poi_4",
        "lat": 22.648812,
        "lon": 120.348532,
        "alt": 60,
        "title": "生創大樓",
        "class": 0
    },
    {
        "id": "poi_5",
        "lat": 22.650623,
        "lon": 120.350075,
        "alt": 70,
        "title": "體育室",
        "class": 0
    },
    {
        "id": "poi_6",
        "lat": 22.651322,
        "lon": 120.350266,
        "alt": 70,
        "title": "幼兒園",
        "class": 0
    },
    {
        "id": "poi_7",
        "lat": 22.650906,
        "lon": 120.350678,
        "alt": 60,
        "title": "土木工程館",
        "class": 0
    },
    {
        "id": "poi_8",
        "lat": 22.650220,
        "lon": 120.349903,
        "alt": 60,
        "title": "妝彩系館",
        "class": 0
    },
    {
        "id": "poi_9",
        "lat": 22.651062,
        "lon": 120.350254,
        "alt": 60,
        "title": "電子工程館",
        "class": 0
    },
    {
        "id": "poi_10",
        "lat": 22.649151,
        "lon": 120.349836,
        "alt": 50,
        "title": "學生活動中心",
        "class": 0
    },
    {
        "id": "poi_11",
        "lat": 22.648993,
        "lon": 120.349423,
        "alt": 70,
        "title": "工業管理館",
        "class": 0
    },
    {
        "id": "poi_12",
        "lat": 22.650592,
        "lon": 120.350523,
        "alt": 50,
        "title": "超微量實驗室",
        "class": 0
    },
    {
        "id": "poi_13",
        "lat": 22.648353,
        "lon": 120.349603,
        "alt": 75,
        "title": "機械工程館",
        "class": 0
    },
    {
        "id": "poi_14",
        "lat": 22.647977,
        "lon": 120.350959,
        "alt": 75,
        "title": "電機工程館",
        "class": 0
    },
    {
        "id": "poi_15",
        "lat": 22.647589,
        "lon": 120.351133,
        "alt": 75,
        "title": "南校區教學大樓",
        "class": 0
    },
    {
        "id": "poi_16",
        "lat": 22.647152,
        "lon": 120.350959,
        "alt": 75,
        "title": "管理學院",
        "class": 0
    },
    {
        "id": "poi_17",
        "lat": 22.647402,
        "lon": 120.351682,
        "alt": 45,
        "title": "學生宿舍",
        "class": 0
    },
    {
        "id": "poi_18",
        "lat": 22.650077,
        "lon": 120.350358,
        "alt": 45,
        "title": "幼兒保育館",
        "class": 0
    },
    {
        "id": "poi_19",
        "lat": 22.649222,
        "lon": 120.350384,
        "alt": 45,
        "title": "籃球場",
        "class": 3,
        "color": "#707070"
    },
    {
        "id": "poi_20",
        "lat": 22.650702,
        "lon": 120.350197,
        "alt": 45,
        "title": "桌球室",
        "class": 3,
        "color": "#707070"
    },
    {
        "id": "poi_21",
        "lat": 22.649510,
        "lon": 120.350462,
        "alt": 45,
        "title": "網球場",
        "class": 3,
        "color": "#707070"
    },
    {
        "id": "poi_22",
        "lat": 22.649160,
        "lon": 120.349773,
        "alt": 45,
        "title": "羽毛球場",
        "class": 3,
        "color": "#f5f5f5"
    },
    {
        "id": "poi_23",
        "lat": 22.650536,
        "lon": 120.350149,
        "alt": 45,
        "title": "撞球室",
        "class": 3,
        "color": "#707070"
    },
    {
        "id": "poi_24",
        "lat": 22.649608,
        "lon": 120.350498,
        "alt": 45,
        "title": "排球場",
        "class": 3,
        "color": "#707070"
    },
    {
        "id": "poi_25",
        "lat": 22.648536,
        "lon": 120.350849,
        "alt": 45,
        "title": "7-11正修門市",
        "class": 4
    },
    {
        "id": "poi_26",
        "lat": 22.648206,
        "lon": 120.350243,
        "alt": 45,
        "title": "麗文書局正修店",
        "class": 4
    },
    {
        "id": "poi_27",
        "lat": 22.650361,
        "lon": 120.349650,
        "alt": 45,
        "title": "人事處",
        "class": 1
    },
    {
        "id": "poi_28",
        "lat": 22.650115,
        "lon": 120.350411,
        "alt": 45,
        "title": "軍訓處",
        "class": 1
    },
    {
        "id": "poi_29",
        "lat": 22.650701,
        "lon": 120.350088,
        "alt": 45,
        "title": "體育組",
        "class": 1
    },
    {
        "id": "poi_30",
        "lat": 22.649254,
        "lon": 120.349920,
        "alt": 45,
        "title": "學生事務處",
        "class": 1
    },
    {
        "id": "poi_31",
        "lat": 22.650682,
        "lon": 120.349825,
        "alt": 45,
        "title": "總務處",
        "class": 1
    },
    {
        "id": "poi_32",
        "lat": 22.648206,
        "lon": 120.350243,
        "alt": 45,
        "title": "國際事務處",
        "class": 1
    },
    {
        "id": "poi_33",
        "lat": 22.648206,
        "lon": 120.350243,
        "alt": 45,
        "title": "圖書資訊處",
        "class": 1
    },
    {
        "id": "poi_34",
        "lat": 22.648206,
        "lon": 120.350243,
        "alt": 45,
        "title": "會計處",
        "class": 1
    },
    {
        "id": "poi_35",
        "lat": 22.650393,
        "lon": 120.349114,
        "alt": 45,
        "title": "A棟機車停車場",
        "class": 5
    },
    {
        "id": "poi_36",
        "lat": 22.648890,
        "lon": 120.350721,
        "alt": 45,
        "title": "D棟機車停車場",
        "class": 5
    },
    {
        "id": "poi_37",
        "lat": 22.651428,
        "lon": 120.349533,
        "alt": 45,
        "title": "B棟汽車停車場",
        "class": 5
    },
    {
        "id": "poi_38",
        "lat": 22.649180,
        "lon": 120.349900,
        "alt": 45,
        "title": "SUBWAY",
        "class": 2
    },
    {
        "id": "poi_39",
        "lat": 22.649045,
        "lon": 120.349889,
        "alt": 45,
        "title": "Mama's樂活廚坊",
        "class": 2
    },
    {
        "id": "poi_40",
        "lat": 22.649117,
        "lon": 120.349896,
        "alt": 45,
        "title": "麵食料理",
        "class": 2
    },
    {
        "id": "poi_41",
        "lat": 22.649242,
        "lon": 120.349896,
        "alt": 45,
        "title": "八方雲集鍋貼水餃專門店",
        "class": 2
    },
    {
        "id": "poi_42",
        "lat": 22.649044, 
        "lon": 120.349699,
        "alt": 45,
        "title": "盥洗室",
        "class": 6,
        "keyword": [{ "ky": "廁所,洗手間," }]
    },
    {
        "id": "poi_43",
        "lat": 22.649861, 
        "lon": 120.350315,
        "alt": 45,
        "title": "盥洗室",
        "class": 6,
        "keyword": [{ "ky": "廁所,洗手間," }]
    },
    {
        "id": "poi_44",
        "lat": 22.649414, 
        "lon": 120.350218,
        "alt": 45,
        "title": "盥洗室",
        "class": 6,
        "keyword": [{ "ky": "廁所,洗手間," }]
    }
];