var poiData = [
    {
        "id": "poi_1",
        "lat": 22.648207,
        "lon": 120.350123,
        "alt": 60,
        "title": "圖科大樓",
        "class": "0"
    },
    {
        "id": "poi_2",
        "lat": 22.648583,
        "lon": 120.350790,
        "alt": 55,
        "title": "人文大樓",
        "class": "0"
    },
    {
        "id": "poi_3",
        "lat": 22.650761,
        "lon": 120.349651,
        "alt": 70,
        "title": "行政大樓",
        "class": "0"
    },
    {
        "id": "poi_4",
        "lat": 22.648812,
        "lon": 120.348532,
        "alt": 60,
        "title": "生創大樓",
        "class": "0"
    },
    {
        "id": "poi_5",
        "lat": 22.650623,
        "lon": 120.350075,
        "alt": 70,
        "title": "體育室",
        "class": "0"
    },
    {
        "id": "poi_6",
        "lat": 22.651322,
        "lon": 120.350266,
        "alt": 70,
        "title": "幼兒園",
        "class": "0"
    },
    {
        "id": "poi_7",
        "lat": 22.650906, 
        "lon": 120.350678,
        "alt": 60,
        "title": "土木工程館",
        "class": "0"
    },
    {
        "id": "poi_8",
        "lat": 22.650220,
        "lon": 120.349903,
        "alt": 60,
        "title": "妝彩系館",
        "class": "0"
    },
    {
        "id": "poi_9",
        "lat": 22.651062, 
        "lon": 120.350254,
        "alt": 60,
        "title": "電子工程館",
        "class": "0"
    },
    {
        "id": "poi_10",
        "lat": 22.649151,
        "lon": 120.349836,
        "alt": 50,
        "title": "學生活動中心",
        "class": "0"
    },
    {
        "id": "poi_11",
        "lat": 22.648993,
        "lon": 120.349423,
        "alt": 70,
        "title": "工業管理館",
        "class": "0"
    },
    {
        "id": "poi_12",
        "lat": 22.650592,
        "lon": 120.350523,
        "alt": 50,
        "title": "超微量實驗室",
        "class": "0"
    },
    {
        "id": "poi_13",
        "lat": 22.648535,
        "lon": 120.350749,
        "alt": 75,
        "title": "7-11正修門市",
        "class": "1"
    },
    {
        "id": "poi_14",
        "lat": 22.648208,
        "lon": 120.350211,
        "alt": 75,
        "title": "麗文正修店",
        "class": "1"
    }
];